# 1、数据的索引和切片
"""
索引：获取数组中特定位置元素的过程
切片：获取数组元素子集的过程

一维数组的索引和切片，与python的列表相似
In [1]: import numpy

In [2]: a=numpy.array([9,8,7,6,5])

In [3]: a[2]
Out[3]: 7

In [4]: a[1:4:2]
Out[4]: array([8, 6])

"""

# 2、多维数组的索引
"""
In [1]: import numpy                                                                                                                      

In [2]: a=numpy.arange(24).reshape((2,3,4))                                                                                               

In [3]: a                                                                                                                                 
Out[3]: 
array([[[ 0,  1,  2,  3],
        [ 4,  5,  6,  7],
        [ 8,  9, 10, 11]],

       [[12, 13, 14, 15],
        [16, 17, 18, 19],
        [20, 21, 22, 23]]])

In [4]: a[1,2,3]                                                                                                                          
Out[4]: 23

In [5]: a[0,1,2]                                                                                                                          
Out[5]: 6

In [6]: a[-1,-2,-3]                                                                                                                       
Out[6]: 17

"""

# 3、多维数组的切片
"""
In [1]: import numpy                                                                                                                      

In [2]: a=numpy.arange(24).reshape((2,3,4))  
In [7]: a[:,1,-3]       # 选取一个维度用：                                                                                                                         
Out[7]: array([ 5, 17])

In [8]: a[:,1:3,:]      # 每个维度切片方法与一维数组相同                                                                                                                            
Out[8]: 
array([[[ 4,  5,  6,  7],
        [ 8,  9, 10, 11]],

       [[16, 17, 18, 19],
        [20, 21, 22, 23]]])

In [9]: a[:,:,::2]      # 每个维度可以使用步长跳跃切片                                                                                                                        
Out[9]: 
array([[[ 0,  2],
        [ 4,  6],
        [ 8, 10]],

       [[12, 14],
        [16, 18],
        [20, 22]]])

"""






















