#####字典是一个无序的，可以修改的，元素呈键值对形式的，以逗号分割的，以大括号包围的序列

#####字典是python数据类型中唯一一个映射关系的数据类型

#####由于字典是无序的，所以定义字典时元素的顺序和生成字典后的元素顺序是不一样的

#####字典也可以存取多个数据，字典中的值并没有特殊的顺序

#####列表中查找元素只能通过元素的索引去查找，在字典中通过键去获取值
# dict_one={'name':'zhang','age':18,'address':'huhehaote'}
# print(dict_one['address'])

# 也可以通过get方法获取值
# dict_one={'name':'zhang','age':18,'address':'huhehaote'}
# print(dict_one.get('name'))

#####Python字典的特点
'''
1、因为字典是无序的，所以字典是没有索引的
2、因为字典没有索引至所以字典是以键取值
3、字典以键取值，所以字典的键是唯一不可修改的
4、因为字典的键是不可修改的，所以列表和字典等可变类型的数据是不可以做键的
'''













